package cn.studyjams.s1.sj19.quhaofeng;

/**
 * Created by Quhaofeng on 16-4-26.<br/>
 * 这个类主要用于存放WebView所要用到的html的文本
 */
public class Detial {
    /**
     * 第一篇文章，羽毛球的简介，介绍了起源
     */
    public static String articleOne = "<html>\n" +
            "<body>\n" +
            "<h3>\n" +
            "羽毛球的来源\n" +
            "</h3>\n" +
            "<p>\n" +
            "羽毛球是一项室内，室外兼顾的运动。依据参与的人数，可以分为单打与双打。羽毛球拍一般由拍头、拍杆、拍柄及拍框与拍杆的接头构成。一支球拍的长度不超过68厘米，其中球拍柄与球拍杆长度不超过41厘米，拍框长度为28厘米，宽为23厘米，随着科学技术的发展，球拍的发展向着重量越来越轻、拍框越来越硬、拍杆弹性越来越好的方向发展。适合东方人发展。\n" +
            "现代羽毛球运动起源于英国。1873年，在英国格拉斯哥郡的伯明顿镇有一位叫鲍弗特的公爵， 在他的领地开游园会，有几个从印度回来的退役军官就向大家介绍了一种隔网用拍子来回击打毽球的游戏，人们对此产生了很大的兴趣。因这项活动极富趣味性，很快就在上层社会社交场上风行开来。“伯明顿”（Badminton）即成为英文羽毛球的名字。1893年，英国14个羽毛球俱乐部组成羽毛球协会，即全英公开赛的前身。自1992年起，羽毛球成为奥运会的正式比赛项目。\n" +
            "</p>\n" +
            "<p>现代羽毛球运动起源于英国。1873年，在英国格拉斯哥郡的伯明顿镇有一位叫鲍弗特的公爵， 在他的领地开游园会，有几个从印度回来的退役军官就向大家介绍了一种隔网用拍子来回击打毽球的游戏，人们对此产生了很大的兴趣。因这项活动极富趣味性，很快就在上层社会社交场上风行开来。“伯明顿”（Badminton）即成为英文羽毛球的名字。1893年，英国14个羽毛球俱乐部组成羽毛球协会，即全英公开赛的前身。自1992年起，羽毛球成为奥运会的正式比赛项目。\n" +
            "</p>\n" +
            "</body>\n" +
            "</html>";

    /**
     * 第二篇文章，介绍了羽毛球的场地要求
     */
    public static String articleTwo = "<html>\n" +
            "<body>\n" +
            "<h3>\n" +
            "羽毛球的划分\n" +
            "</h3>\n" +
            "<p>\n" +
            "正如图片上所示，左边蓝色的区域是双打的羽毛球界限，双打发球时，队员需要往对方场地对角线的区域发球，且发球要落在颜色较深的区域才算有效发球；同样道理，图片上，右边红色区域是单打的界限，并且发球要落在对角颜色较深的区域。有一个比较好记忆的方法，「单打界线窄而长，双打界线宽而长」。\n" +
            "</p>\n" +
            "<h3>\n" +
            "羽毛球的场地规格\n" +
            "</h3>\n" +
            "<p>羽毛球场呈长方形，各条线宽均为4厘米，场地上空12米以内和四周4米以内不应有障碍物。球场中央网高1.524米，双打边线处网高1.55米。\n" +
            "</p>\n" +
            "<p>\n" +
            "羽毛球场地标准羽毛球场为一长方形场地，长度为13.40米，双打场地宽为6.10米，单打场地宽为5.18米。球场上各条线宽均为4厘米，丈量时要从线的外沿算起。球场界限最好用白色、黄色或其它易于识别的颜色画出。按国际比赛规定，整个球场上空的空间最低为9米，距离。球场四周的墙壁最好为深绿色，不能有风。\n" +
            "</p>\n" +
            "<p>\n" +
            "地面应为塑胶或经国际羽联批准的草绿色和种类的可移动PVC塑胶运动地板。\n" +
            "地板具有弹性，没有其它体育项目的标线和标识。地板的颜色不能太浅或反光强烈，可为绿色或草绿色；不能过量使用油或蜡，以避免打滑。\n" +
            "</p>\n" +
            "</body>\n" +
            "</html>";

    /**
     * 第三篇文章，介绍了比赛的规则
     */
    public static String articleThree = "<html>\n" +
            "<body>\n" +
            "<h3>\n" +
            "羽毛球的比赛规则\n" +
            "</h3>\n" +
            "\n" +
            "<ul>\n" +
            "  <li><b>基本计分方式</b></li>\n" +
            "  <p>（1）采用21分制，即双方分数先达21分者胜，3局2胜。每局双方打到20平后，一方领先2分即算该局获胜；若双方打成29平后，一方领先1分，即算该局取胜。<br/>\n" +
            "（2）得分者方有发球权，如果本方得单数分，从左边发球；得双数分，从右边发球。在第三局或只进行一局的比赛中，当一方分数首先到达11分时，双方交换场区。\n" +
            "  </p>\n" +
            "  <li><b>单打</b></li>\n" +
            "  <p>\n" +
            "  （1）发球员的分数为0或双数时，双方运动员均应在各自的右发球区发球或接发球。<br/>\n" +
            "（2）发球员的分数为单数时，双方运动员均应在各自的左发球区发球或接发球。<br/>\n" +
            "（3）如“再赛”，发球员应以该局的总的分数来确定站位。若总分为15分（单数），双方运动员均应在各自的左发球区发球或接发球；若总分为16分（双数），双方运动员均应在各自的右发球区发球或接发球。<br/>\n" +
            "（4）球发出后，双方运动员就不再受发球区的限制而自由击到对方场区的任何位置，运动员的站位也可以在自己这方场区的界内或界外。\n" +
            "  </p>\n" +
            "  <li><b>双打</b></li>\n" +
            "  <p>\n" +
            "  （1）一局比赛开始，应从右发球区开始发球。<br/>\n" +
            "（2）只有接发球员才能接发球；如果他的同伴去接球或被球触及，发球方得一分。<br/>\n" +
            " ①在发球方得分为0或双数时，应该由发球方的站在右侧的运动员发球，接发球方站在右侧的运动员接发球；发球方得分为单数时，则应站在左发球区的运动员发球或接发球。<br/>\n" +
            " ②每局开始首先接发球的运动员，在该局本方得分为0或双数时，都必须在右发球区接发球或发球；得分为单数时，则应在左发球区接发球或发球。<br/>\n" +
            " ③上述两条相反形式的站位适用于他们的同伴。<br/>\n" +
            "（3）任何一局的本方发球员失去发球权后，同时对手获得一分，接着由他们的对手之一发球，如此传递发球权，注意，此时双方4位运动员都不需要变换站位。<br/>\n" +
            "（4）运动员不得有发球错误和接发球的错误，或在同一局比赛中有两次发球。<br/>\n" +
            "（5）一局胜方的任一运动员可在下一局先发球，负方中任一运动员可先接发球。<br/>\n" +
            "（6）球发出后就不再受发球区的限制了。运动员可在本方场区自由站位和将球击到对方场区的任何位置。\n" +
            "  </p>\n" +
            "</ul>\n" +
            "</body>\n" +
            "</html>";
    /**
     * 第四篇文章，介绍了打球的技巧
     */
    public static String articleFour = "<html>\n" +
            "<body>\n" +
            "<h3>\n" +
            "羽毛球的一些技巧\n" +
            "</h3>\n" +
            "<ol>\n" +
            "  <li><b>压后场底线</b></li>\n" +
            "  <p>对羽毛球初学者来说，这是必须掌握的基本打法。它的特点是通过高球把对方拉到后场底线，使得对方回球不到位时大力扣杀或吊网前空挡。这种打法主要以力量制胜对方，也就是较量后场高、吊、杀技术的高低。运用这种打法首先自己的高球必须打到对方底线，同时也要有和对方进行后场对抗的能力。\n" +
            "  </p>\n" +
            "  <li><b>攻四方球控制落点</b></li>\n" +
            "  <p>\n" +
            "攻四方球是攻击对方场区的4个角落，以快速和准确的落点，调动对方前后左右奔跑，打乱对方阵脚，待其来不及回中心位置或回球质量较差时，向其空当部位发动进攻。这种打法，要求运动员本身具有快速、灵活的步法，稳健的防守，以及准确控制落点和强有力的进攻能力。\n" +
            "  </p>\n" +
            "  <li><b>快拉快吊控制网前</b></li>\n" +
            "  <p>\n" +
            "这是最常用的一种积极主动、快速进攻的打法。它的特点是：以进攻性的平高球快压对方于后场两底角，而后突击吊球或劈杀引对方上网，再迅速上网控制网前，以网前搓球结合推后场底线制造对方回击的困难，从而创造中后场大力扣杀的机会。它要求运动员有较全面的技术，能攻善守，步法、手法快速灵活，特别是要有较细腻的控制网前的技术。学习者通常在掌握了较全面的技术后使用。\n" +
            "  </p>\n" +
            "    <li><b>后场下压，上网搓、推</b></li>\n" +
            "  <p>\n" +
            "这种打法的特点是在后场通过下压击球(扣杀、劈杀或吊球)的进攻技术，快速上网搓或推球取得前场攻势，使后场、前场的进攻紧密衔接，提高攻击的威力。\n" +
            "  </p>\n" +
            "    <li><b>守中反攻</b></li>\n" +
            "  <p>\n" +
            "这种打法是从运动员身材较矮、但较灵活这个特点出发的。它以防御为主结合反攻(扣杀、吊球)，这里包含着让对方多失误、自己尽量少失误的策略思想。怎样才能让对方多失误呢?这要求自己善于控制落点、球路，调动对方在移动中勉强进攻，急于求成出现失误，或给自己制造反攻的机会。那么，怎样又才能使自己尽量少失误呢?这要求自己有快速灵活的步法，能在场区任何一个角落抢救来球，;守住对方的强攻;同时抓住有利的战机，进行出击。\n" +
            "  </p>\n" +
            "</ol>\n" +
            "</body>\n" +
            "</html>";

    /**
     * 第五篇文章，介绍了其他有关羽毛球的知识
     */
    public static String articleFive = "<html>\n" +
            "<body>\n" +
            "<h3>\n" +
            "羽毛球的其他知识\n" +
            "</h3>\n" +
            "<p><b>热身：<br/>运动前一定要热身！<br/>运动前一定要热身！<br/>运动前一定要热身！<br/></b>运动前要对各个关节进行热身，热身后不容易导致崴伤。\n" +
            "</p>\n" +
            "<p>\n" +
            "<b>球拍选择:</b>适合自己的才是最好的。没有购拍和打球经验的新手，第一次选购时，可买便宜一些的、低价位的球拍，低价位球拍一般没有强烈的个性，新手、一般人群都能适应，贵价拍当然好，但往往个性很强，不是偏硬就是偏重，只有那种力量不成问题的高手才能驾驶、控制之。新手打了几年以后，再根据自己的打法特点和力量情况选购适合自己的高价位球拍。<br/>\n" +
            "新手、新拍第一次拉线建议在20-23磅之间，磅数太高的话，弹性小，新手打不到后场，而且拍线易断，两支拍子碰撞时，往往拉线磅数高的拍子易“牺牲”；磅数太低，则控球不准确，击球有“滞后、粘连”的感觉，不爽。另外，一定要绑上合适的柄皮或毛巾胶，这样可以大大增强手感以及手指对球拍的控制力。\n" +
            "</p>\n" +
            "<p><b>选择甜区更大的拍形：</b>所谓甜区，就是球拍面的最佳击球区。当击球点在甜区时能给你足够的击球威力、控球性、震动感很小，你会觉得很舒适\n" +
            "</p>\n" +
            "<p><b>注意击球的姿势是否正确：</b>击球姿势的不正确是造成受伤的重要原因。如：击球点过低、过后、击球时侧身不够、甩动大臂击球等等。多请教你身边的高手，纠正你的错误。\n" +
            "</p>\n" +
            "<p>\n" +
            "<b>击球点：</b>击球点包括三个方面的内容：第一包括拍和球的接触点距地面的高度；第二包括接触点距身体的前后距离；第三包括距身体的左右距离。对击球点选择得是否合适，将决定着击球质量的好坏，它将直接影响着运动员击球的力量、速度、弧线、落点，最终将导致影响运动员击球的命中率，造成失分，直至失败。因此选择合适的击球点至关重大。选择合适的击球点应做到如下两点：第一判断要准，第二步法移动要到位（步法要快）。只要做到了这两点才能保证调整在最合适的位置，击球点才有保障。\n" +
            "</p>\n" +
            "</body>\n" +
            "</html>";
}
